Revit 2024 API
PartMakerMethodToDivideVolumes.DivisionPatternMirror Property
 Whether pattern defined by the division rule should be mirrored before application Mirroring is similar to changing indices of u-const gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool DivisionPatternMirror { get; set; }
Visual Basic
Public Property DivisionPatternMirror As Boolean
	Get
	Set
Visual C++
public:
property bool DivisionPatternMirror {
	bool get ();
	void set (bool value);
}
See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace